### Dealing With Missing Data in Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
daf = {'A':[4,5,np.nan],'B':[7,np.nan,np.nan],'C':[3,5,7]}
df = pd.DataFrame(daf)
df

     A    B  C
0  4.0  7.0  3
1  5.0  NaN  5
2  NaN  NaN  7

In [3]:
# Ex 1:- Dropping rows that has Missing ("Nan") values...

df.dropna()

     A    B  C
0  4.0  7.0  3

In [4]:
# Ex 1:- Dropping columns that has Missing ("Nan") values...

df.dropna(axis=1)

   C
0  3
1  5
2  7

In [5]:
# Ex 2: Specifying a threshhold means dropping a specific row...

df.dropna(thresh=2)

     A    B  C
0  4.0  7.0  3
1  5.0  NaN  5

In [6]:
# Ex 3:- Filling/replacing missing values ("Nan") w/something else....

df.fillna(value="Not a Number")

              A             B  C
0             4             7  3
1             5  Not a Number  5
2  Not a Number  Not a Number  7

In [7]:
# Ex 4:- Filling the value of the mean of a column....

df['B']

0    7.0
1    NaN
2    NaN
Name: B, dtype: float64

In [8]:
# Ex 5:- To get the mean of column 'A' & filling it in the rows of column A w/missing value....

df['A'].fillna(value=df['A'].mean())

0    4.0
1    5.0
2    4.5
Name: A, dtype: float64

In [9]:
# Ex 6:- To get the mean of column 'C' & filling it in the rows of column B w/missing value....

df['B'].fillna(value=df['C'].mean())

0    7.0
1    5.0
2    5.0
Name: B, dtype: float64

## Groupby

In [10]:
# Creating a DataFrame...

emp_data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB','AMZN','AMZN', 'AMZN'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah','Victor','Kellyanne','Anne-Marie'],
       'Sales':[200,120,340,124,243,350,450,400,419]}

In [11]:
df1 = pd.DataFrame(emp_data)
df1

  Company      Person  Sales
0    GOOG         Sam    200
1    GOOG     Charlie    120
2    MSFT         Amy    340
3    MSFT     Vanessa    124
4      FB        Carl    243
5      FB       Sarah    350
6    AMZN      Victor    450
7    AMZN   Kellyanne    400
8    AMZN  Anne-Marie    419

In [12]:
# GroupBy means aggregrating data - Sum, mean, standard deviation, etc...
# From our df1 DataFrame, we can't group the "Person" col, because it has one name attached to a person
# But we can group the "Company" and use aggregrate functions on them....

# Ex 7:- 
comp_grp = df1.groupby('Company')
comp_grp

In [13]:
comp_grp.sum()

         Sales
Company
AMZN      1269
FB         593
GOOG       320
MSFT       464

In [14]:
comp_grp.mean()

         Sales
Company
AMZN     423.0
FB       296.5
GOOG     160.0
MSFT     232.0

In [15]:
comp_grp.std()

              Sales
Company
AMZN      25.238859
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [16]:
# Ex 7ii:-

comp_grp.sum().loc['MSFT']

Sales    464
Name: MSFT, dtype: int64

In [17]:
df1.groupby('Company').sum().loc['MSFT']

Sales    464
Name: MSFT, dtype: int64

In [18]:
# Ex 7iii: To see how many instances of a "Person" occur in that column per "Company"

df1.groupby('Company').count()

         Person  Sales
Company
AMZN          3      3
FB            2      2
GOOG          2      2
MSFT          2      2

In [19]:
# Ex 7iv:- The "person" w/maximum number of "sales" from each "Company" 

comp_grp.max()

          Person  Sales
Company
AMZN      Victor    450
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [20]:
# Ex 8:- To view the aggregrate functions and values...

comp_grp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
AMZN      3.0  423.0   25.238859  400.0  409.50  419.0  434.50  450.0
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [21]:
# Ex 9:-

comp_grp.describe().transpose()

Company            AMZN          FB        GOOG        MSFT
Sales count    3.000000    2.000000    2.000000    2.000000
      mean   423.000000  296.500000  160.000000  232.000000
      std     25.238859   75.660426   56.568542  152.735065
      min    400.000000  243.000000  120.000000  124.000000
      25%    409.500000  269.750000  140.000000  178.000000
      50%    419.000000  296.500000  160.000000  232.000000
      75%    434.500000  323.250000  180.000000  286.000000
      max    450.000000  350.000000  200.000000  340.000000